lxl-git05/HUST_STI_1/Templete/Template_STM32H743VIT6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "tim.h"
#include "usart.h"
#include "gpio.h"


#include <stdio.h>
#include "math.h"
#include "stdlib.h"	
#include <stdbool.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY0_Pin GPIO_PIN_3
#define KEY0_GPIO_Port GPIOE
#define KEY1_Pin GPIO_PIN_0
#define KEY1_GPIO_Port GPIOC
#define KEY2_Pin GPIO_PIN_1
#define KEY2_GPIO_Port GPIOC
#define AT_SCL_Pin GPIO_PIN_4
#define AT_SCL_GPIO_Port GPIOA
#define AT_SDA_Pin GPIO_PIN_5
#define AT_SDA_GPIO_Port GPIOA
#define EC11_S1_Pin GPIO_PIN_4
#define EC11_S1_GPIO_Port GPIOC
#define EC11_S1_EXTI_IRQn EXTI4_IRQn
#define EC11_S2_Pin GPIO_PIN_5
#define EC11_S2_GPIO_Port GPIOC
#define EC11_S2_EXTI_IRQn EXTI9_5_IRQn
#define EC11_Key_Pin GPIO_PIN_0
#define EC11_Key_GPIO_Port GPIOB
#define Buzzer_Pin GPIO_PIN_8
#define Buzzer_GPIO_Port GPIOE
#define Motor_A_IN2_Pin GPIO_PIN_10
#define Motor_A_IN2_GPIO_Port GPIOD
#define Motor_B_IN2_Pin GPIO_PIN_11
#define Motor_B_IN2_GPIO_Port GPIOD
#define Motor_A_IN1_Pin GPIO_PIN_12
#define Motor_A_IN1_GPIO_Port GPIOD
#define Motor_B_IN1_Pin GPIO_PIN_13
#define Motor_B_IN1_GPIO_Port GPIOD
#define LED0_Pin GPIO_PIN_8
#define LED0_GPIO_Port GPIOA
#define OLED_SCL_Pin GPIO_PIN_8
#define OLED_SCL_GPIO_Port GPIOB
#define OLED_SDA_Pin GPIO_PIN_9
#define OLED_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
